{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.3.1", "config": {"name": "model_1", "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null], "dtype": "float32", "name": "encoder_inputs"}, "name": "encoder_inputs"}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "class_name": "Embedding", "config": {"mask_zero": false, "embeddings_regularizer": null, "trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "batch_input_shape": [null, 13], "activity_regularizer": null, "output_dim": 256, "dtype": "float32", "input_dim": 1368, "name": "encoder_embedding", "input_length": 13, "embeddings_constraint": null}, "name": "encoder_embedding"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, null, 1623], "dtype": "float32", "name": "decoder_inputs"}, "name": "decoder_inputs"}, {"inbound_nodes": [[["encoder_embedding", 0, 0, {}]]], "class_name": "LSTM", "config": {"use_bias": true, "trainable": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": false, "implementation": 2, "bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_constraint": null, "name": "encoder_lstm", "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "return_state": true, "units": 256, "recurrent_activation": "sigmoid", "kernel_regularizer": null}, "name": "encoder_lstm"}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "class_name": "LSTM", "config": {"use_bias": true, "trainable": true, "activation": "tanh", "bias_regularizer": null, "return_sequences": true, "implementation": 2, "bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "kernel_constraint": null, "recurrent_regularizer": null, "stateful": false, "recurrent_constraint": null, "name": "decoder_lstm", "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "return_state": true, "units": 256, "recurrent_activation": "sigmoid", "kernel_regularizer": null}, "name": "decoder_lstm"}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "units": 1623, "kernel_regularizer": null, "dtype": "float32", "name": "decoder_dense"}, "name": "decoder_dense"}], "output_layers": [["decoder_dense", 0, 0]]}}